{
  "name": "Sunrise Java",
  "description": "Create your own webshop in minutes with commercetools and our template 'Sunrise' for Java",
  "repository": "https://github.com/sphereio/commercetools-sunrise-java",
  "logo": "http://www.commercetools.com/assets/img/ct_logo_farbe.gif",
  "keywords": ["commercetools", "ecommerce", "shopping"],
  "env": {
    "CTP_PROJECT_KEY": {
      "description": "The project key for your commercetools platform project."
    },
    "CTP_CLIENT_ID": {
      "description": "The client ID of your commercetools platform project."
    },
    "CTP_CLIENT_SECRET": {
      "description": "The client secret of your commercetools platform project."
    },

    "DISPLAYED_ATTRIBUTES": {
      "description": "Product attributes that are displayed for a specific product variant (this does not allow to select different product variants, please check soft/hard selectable attributes for that purpose). Enter the attribute names separated by commas.",
      "required": false
    },

    "HARD_SELECTABLE_ATTRIBUTES": {
      "description": "List of those product attributes that when selected require loading a different URL to display the selected variant (e.g. you would like to share the product URL for a particular color variant). Enter the attribute names separated by commas.",
      "required" : false
    },

    "SOFT_SELECTABLE_ATTRIBUTES": {
      "description": "List of those product attributes that when selected DO NOT require loading a different URL to display the selected variant (e.g. size). Enter the attribute names separated by commas.",
      "required" : false
    },

    "SALES_CATEGORY": {
      "description": "The sales category in your project. Enter the category external ID.",
      "required": false
    },
    "NEW_CATEGORY": {
      "description": "The category containing the new products in your project. Enter the category external ID.",
      "required": false
    },

    "HOME_SUGGESTIONS_CATEGORIES": {
      "description": "The categories where to obtain the products shown in the home page suggestions. Enter the category external IDs separated by commas.",
      "required": false
    },

    "HOME_SUGGESTIONS_SIZE": {
      "description": "The amount of products displayed in the home page suggestions.",
      "value": 4,
      "required": false
    },
    "PRODUCT_SUGGESTIONS_SIZE": {
      "description": "The amount of products displayed for a product's suggestions.",
      "value": 4,
      "required": false
    },

    "SEARCH_FIELD": {
      "description": "Field in the URL query string containing the searched term.",
      "value": "q",
      "required": false
    },
    "SORT_FIELD": {
      "description": "Field in the URL query string containing the sorting criteria.",
      "value": "sort",
      "required": false
    },
    "PRODUCTS_PER_PAGE_FIELD": {
      "description": "Field in the URL query string containing the amount of products per page.",
      "value": "display",
      "required": false
    },
    "PRODUCTS_PER_PAGE_OPTIONS": {
      "description": "Available options to select the amount of products per page. Enter the values separated by commas.",
      "value": "24, 48",
      "required": false
    },
    "PRODUCTS_PER_PAGE_DEFAULT": {
      "description": "The selected amount of products per page by default.",
      "value": "24",
      "required": false
    },

    "COUNTRIES": {
      "description": "OPTIONAL! LEAVE EMPTY IF YOU WANT THE APPLICATION TO USE THE COUNTRIES DEFINED IN YOUR COMMERCETOOLS PROJECT. If you want to replace them, enter the countries as ISO country codes (e.g. DE) separated by commas. Default country first.",
      "required": false
    },
    "CURRENCIES": {
      "description": "OPTIONAL! LEAVE EMPTY IF YOU WANT THE APPLICATION TO USE THE CURRENCIES DEFINED IN YOUR COMMERCETOOLS PROJECT. If you want to replace them, enter the currencies as ISO currency codes (e.g. EUR) separated by commas. Default currency first.",
      "required": false
    },
    "LANGUAGES": {
      "description": "OPTIONAL! LEAVE EMPTY IF YOU WANT THE APPLICATION TO USE THE LANGUAGES DEFINED IN YOUR COMMERCETOOLS PROJECT. If you want to replace them, enter the languages as language tags (e.g. en-UK) separated by commas. Default language first.",
      "required": false
    },


    "BASIC_AUTH_CREDENTIALS": {
      "description": "OPTIONAL! LEAVE EMPTY IF YOU DO NOT WANT TO ENABLE BASIC AUTHENTICATION. If you only want authorized users to access your website, please enter here the required credentials separated by colon ':'. For example, for a username 'john' and password 'secret', enter 'john:secret'",
      "required": false
    },
    "BASIC_AUTH_REALM": {
      "description": "Authentication realm that identifies your application. This is only necessary when basic authentication is enabled.",
      "value": "Sunrise Demo",
      "required": false
    },
    "APPLICATION_SECRET": {
      "description": "The secret key is used to secure cryptographics functions. Anyone that can get access to the application secret will be able to generate any session they please, effectively allowing them to log in to your system as any user they please. If you deploy your application to several instances be sure to use the same key.",
      "generator": "secret"
    }
  }
}
