{
  "name": "Sunrise Java",
  "description": "Create your own webshop in minutes with commercetools and our template 'Sunrise' for Java",
  "repository": "https://github.com/sphereio/commercetools-sunrise-java",
  "logo": "http://www.commercetools.com/assets/img/ct_logo_farbe.gif",
  "keywords": ["commercetools", "ecommerce", "shopping"],
  "env": {
    "CTP_PROJECT_KEY": {
      "description": "The project key for your commercetools platform project."
    },
    "CTP_CLIENT_ID": {
      "description": "The client ID of your commercetools platform project."
    },
    "CTP_CLIENT_SECRET": {
      "description": "The client secret of your commercetools platform project."
    },

    "SELECTABLE_ATTRIBUTES": {
      "description": "The product attributes that allow to identify and select a product variant in your project. Enter the attribute keys separated by commas."
    },

    "APPLICATION_SECRET": {
      "description": "The secret key is used to secure cryptographics functions. Anyone that can get access to the application secret will be able to generate any session they please, effectively allowing them to log in to your system as any user they please. If you deploy your application to several instances be sure to use the same key.",
      "generator": "secret"
    },

    "COUNTRIES": {
      "description": "The application uses the countries defined in your project. If you want to replace them, enter the list of countries as ISO country codes (e.g. DE). Default country first.",
      "required": false
    },
    "CURRENCIES": {
      "description": "The application uses the currencies defined in your project. If you want to replace them, enter the list of currencies as ISO currency codes (e.g. EUR). Default currency first.",
      "required": false
    },
    "LANGUAGES": {
      "description": "The application uses the languages defined in your project. If you want to replace them, enter the list of languages as language tags (e.g. en-UK). Default language first.",
      "required": false
    },

    "SALES_CATEGORY": {
      "description": "The sales category in your project. Enter the category external ID.",
      "required": false
    },
    "NEW_CATEGORY": {
      "description": "The category containing the new products in your project. Enter the category external ID.",
      "required": false
    },

    "HOME_SUGGESTIONS_CATEGORIES": {
      "description": "The categories where to obtain the products shown in the home page suggestions. Enter the category external IDs separated by commas.",
      "required": false
    },

    "HOME_SUGGESTIONS_SIZE": {
      "description": "The amount of products displayed in the home page suggestions.",
      "required": false
    },
    "PRODUCT_SUGGESTIONS_SIZE": {
      "description": "The amount of products displayed for a product's suggestions.",
      "required": false
    },

    "SEARCH_FIELD": {
      "description": "Field in the URL query string containing the searched term.",
      "value": "q"
    },
    "SORT_FIELD": {
      "description": "Field in the URL query string containing the sorting criteria.",
      "value": "sort"
    },
    "PRODUCTS_PER_PAGE_FIELD": {
      "description": "Field in the URL query string containing the amount of products per page.",
      "value": "display"
    },
    "PRODUCTS_PER_PAGE_OPTIONS": {
      "description": "Available options to select the amount of products per page. Enter the values separated by commas.",
      "value": "24, 48"
    },
    "PRODUCTS_PER_PAGE_DEFAULT": {
      "description": "The selected amount of products per page by default.",
      "value": "24"
    }
  }
}
